src/toir_cfe/src/Documents/проф_КорректировкаЗапасовИПотребностей/проф_КорректировкаЗапасовИПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="74d8fe1a-5251-4bdb-89a0-e4feac5b4dbb">
  <name>проф_КорректировкаЗапасовИПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="df140200-b4e7-404e-9106-49eb4fd2351b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="197d0ecc-e7ae-4048-8b02-e9c3ebc142fa">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1d4274bb-7aec-44b0-ac86-8f45e60bdde5">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e20cc3e5-c658-4334-b655-4db6639b949d">
    <name>ПричинаКорректировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d82a704-6d13-4848-abeb-95bc0edf2814">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4a5f5e5-1fae-4331-b40b-c2d0bd833620">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f66dc17e-6ee9-489c-a7ec-d40d3d955c64">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2fc68760-255e-4c33-85a5-98e11f540114">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8187ba36-cc68-4e95-beef-6a1bca68866a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4f1031b7-f248-42a4-bb5b-e07f817b25ea">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be94bc88-9479-47e3-9a3f-e3bff1f5f5bc">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5b5afc34-0737-4f64-8dd5-fa057dff679e">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04c20f66-e44e-4c0b-b21f-ed44a2d0a107">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="59bd9b14-1cd9-4f15-99e6-4308443b90be">
      <name>ВНаличии</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="542edf58-946d-421b-9acc-22e93c70c077">
      <name>Заказано</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4f0b2692-9640-4e0c-8240-7aa004fe7c69">
      <name>КОбеспечению</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b4203d6d-a8e3-4a94-b6fc-b1eff93c6167">
      <name>НеОбеспечивать</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d7bdd85b-3236-4718-8228-70db30702dd4">
      <name>ОтложитьРезервирование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e004ed37-af33-41bc-894d-f3b14778b226">
      <name>Поступит</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="18b8ab75-204f-4f67-87f4-f086f9201f89">
      <name>РезервироватьНаСкладе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bde86844-9f05-4c74-87a4-bc6b13e9eac8">
      <name>РезервироватьПоМереПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/проф_ЗапасыИПотребности/проф_ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0c3966d-a188-422d-ae41-58971b18740e">
  <name>проф_ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="a09d559f-5429-40de-881e-a7a7455b0805">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3eba9edd-c306-45b3-adbf-0b6bd792797b">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3ff46c0a-d6a1-44d9-93cd-bd1c74e17152">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="796c95c7-1cc0-402b-a66a-b61c30c88768">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8d117610-557c-447a-826b-0939b2755cf2">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce740e0e-f426-41c7-a111-3357412b36f3">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c2c3b72e-9d8c-413c-a97a-18ce1c487b01">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c65a1e77-9998-4c19-8ead-3d53094b11d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f3780b58-1e35-42a5-ae55-269d2c78e18b">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bb4e1824-62e1-414d-8f98-544e41852af9">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="b13a9fdf-bf1e-4886-8c71-f4facd56f75f">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="490da68d-96cb-4e58-bbe6-b68b05d368f7">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b8faf3e1-e88d-430a-9d3b-8fcdf9a97ee7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="904aec5b-9e35-480e-867f-ca8b2baae6d1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/проф_КорректировкаЗапасовИПотребностей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// ++ Проф-ИТ, #180, Сергеев Д., 19.09.2023
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;	
	
	// -- Проф-ИТ, #180, Сергеев Д., 19.09.2023
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ++ Проф-ИТ, #180, Сергеев Д., 19.09.2023
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.проф_КорректировкаЗапасовИПотребностей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Отразитьпроф_ЗапасыИПотребности(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);	
	
	// -- Проф-ИТ, #180, Сергеев Д., 19.09.2023
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ++ Проф-ИТ, #180, Сергеев Д., 19.09.2023

Процедура Отразитьпроф_ЗапасыИПотребности(ДополнительныеСвойства, Движения, Отказ)
	
	Таблицапроф_ЗапасыИПотребности = ДополнительныеСвойства.ТаблицыДляДвижений.проф_ЗапасыИПотребности;
	
	Если Отказ ИЛИ Таблицапроф_ЗапасыИПотребности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движенияпроф_ЗапасыИПотребности = Движения.проф_ЗапасыИПотребности;
	Движенияпроф_ЗапасыИПотребности.Записывать = Истина;
	Движенияпроф_ЗапасыИПотребности.Загрузить(Таблицапроф_ЗапасыИПотребности);		
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	мсвНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВидыНоменклатуры.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивНоменклатуры)";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", мсвНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗнчНоменклатуры = РезультатЗапроса.Выгрузить();
	
	Для каждого текСтрока Из Товары Цикл
		Если ТаблицаЗнчНоменклатуры.Количество() > 0 Тогда
			НайденнаяСтрока = ТаблицаЗнчНоменклатуры.Найти(текСтрока.Номенклатура, "Номенклатура");	
			Если НайденнаяСтрока <> Неопределено 
			И НайденнаяСтрока.ИспользоватьХарактеристики
			И НЕ ЗначениеЗаполнено(текСтрока.Характеристика) Тогда
				
				ТекстСообщения = НСтр("ru = 'В строке %1 не заполнено поле ""Характеристика"".'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текСтрока.НомерСтроки);
				
				ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
									"Товары", текСтрока.НомерСтроки, "Характеристика");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКРеквизиту, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗаполненыРесурсыРНЗапасыИПотребности(текСтрока) Тогда				
			ТекстСообщения = НСтр("ru = 'В строке %1 при проведении документа хотя бы один из реквизитов:
				|ВНаличии, Заказано, КОбеспечению, НеОбеспечивать, ОтложитьРезервирование, Поступит,
				|РезервироватьНаСкладе, РезервироватьПоМереПоступления должен быть заполнен.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текСтрока.НомерСтроки);

			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", текСтрока.НомерСтроки, "ВНаличии");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКРеквизиту, "Объект", Отказ);		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЗаполненыРесурсыРНЗапасыИПотребности(СтрокаТовары)
	
	Если ЗначениеЗаполнено(СтрокаТовары.ВНаличии) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.Заказано) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.КОбеспечению) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.НеОбеспечивать) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.ОтложитьРезервирование) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.Поступит) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.РезервироватьНаСкладе) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.РезервироватьПоМереПоступления) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции	

// -- Проф-ИТ, #180, Сергеев Д., 19.09.2023

#КонецОбласти

#КонецЕсли
